Revit 2027 API
AlignmentStationLabelSetOptions.Offset Property
 The offset of the labels from the alignment, in Revit internal paper space units (standard Imperial feet). A positive offset creates labels to the right of the alignment, a negative - to the left. The default value is null. If null, a predefined offset value will be used, depending on the unit setting for stationing units in the document. For standard imperial, the default is 1/8". For survey imperial, the default is 1/8" (US survey). For metric, the default is 5 mm.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double? Offset { get; set; }
Public Property Offset As Double?
	Get
	Set
public:
property Nullable<double> Offset {
	Nullable<double> get ();
	void set (Nullable<double> value);
}
member Offset : Nullable<float> with get, set
Property Value
Nullable<Double>
See Also
Reference
AlignmentStationLabelSetOptions Class
Autodesk.Revit.DB.Infrastructure Namespace